

# Core Utilities
brew "git"
brew "gh"
brew "gnupg"  # GPG for commit signing
brew "starship"
brew "zoxide"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "jq"
brew "yq"
brew "htop"
brew "btop"  # Modern htop replacement
brew "tldr"
brew "biome"
brew "zellij"  # Modern terminal multiplexer

# Zsh Plugins (for autocompletion & syntax highlighting)
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "carapace"  # Modern multi-shell completion (1000+ commands)

# Modern Rust CLI Tools
brew "fd"  # Modern find
brew "dust"  # Modern du
brew "procs"  # Modern ps
brew "sd"  # Modern sed
brew "tokei"  # Code statistics

# Development Tools
brew "git-delta"  # Better git diff
brew "lazygit"  # Terminal UI for git
brew "httpie"  # User-friendly HTTP client

# Applications
cask "ghostty"
cask "visual-studio-code"
cask "cursor"  # AI-native code editor
cask "google-chrome"
cask "arc"  # Modern browser
cask "docker-desktop"
cask "raycast"
cask "warp"  # Modern terminal (alternative to Ghostty)

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
