

# Core Utilities
brew "git"
brew "gh"
brew "fnm"
brew "starship"
brew "zoxide"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "jq"
brew "yq"
brew "htop"
brew "tldr"
brew "biome"

# Applications
cask "ghostty"
cask "visual-studio-code"
cask "google-chrome"
cask "docker-desktop"
cask "raycast"

# Fonts
cask "font-jetbrains-mono-nerd-font"
